Repository: juliana-albertyn/python_projects
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr_fr, zu_zu

source: Queue
fr_fr: File
zu_zu: Umugqa

source: Count
fr_fr: Compteur
zu_zu: Bala

source: Head
fr_fr: Tête
zu_zu: Ikhanda

source: Tail
fr_fr: Queue (fin)
zu_zu: Umsila

source: Empty?
fr_fr: Vide ?
zu_zu: Ayinalutho?

source: Full?
fr_fr: Pleine ?
zu_zu: Igcwele?

source: Queue is empty
fr_fr: La file est vide
zu_zu: Umugqa awunalutho

source: Queue is full
fr_fr: La file est pleine
zu_zu: Umugqa ugcwele

source: Length
fr_fr: Longueur
zu_zu: Ubude

source: Peek
fr_fr: Consulter (peek)
zu_zu: Bheka (peek)

source: Enqueue
fr_fr: Enfiler
zu_zu: Faka emugqeni

source: Dequeue
fr_fr: Défiler
zu_zu: Khipha emugqeni

source: Cannot enqueue: queue is full
fr_fr: Impossible d’enfiler : la file est pleine
zu_zu: Ayikwazi ukufaka: umugqa ugcwele

source: Cannot dequeue: queue is empty
fr_fr: Impossible de défiler : la file est vide
zu_zu: Ayikwazi ukukhipha: umugqa awunalutho
